{
  "posts": [
    {
      "post_id": "7",
      "thread_id": "7",
      "username": "veb",
      "date": "Apr 26, 2006",
      "content": "How to kick This small tutorial will show you how to kick in Toribash 1. Use the camera keys to get a side view of the 2 fighters (directional keys) 2. Click the ankle and hit \"Z\" on the keyboard. 3. Do the same for the Knee and Hip. 4. If your ghost does not look like it's kicking, click on the ankle/knee/hip again and press Z untill you get your ghost looking like it will kick 5. Once your ghost looks right, press space. 6. The leg will move up, and look like a scene in the matrix. 7. Press it again and extend the leg. Do this by clicking/hovering the knee and pressing Z 8. Press space a few times and marvel at your kick Hope you liked it! ;)",
      "url": "https://forum.toribash.com/showpost.php?p=7",
      "title": "Toribash Community - View Single Post -  How to kick"
    },
    {
      "post_id": "8",
      "thread_id": "8",
      "username": "hampa",
      "date": "Apr 27, 2006",
      "content": "Replays for TB 1.6 Some more or less sick replays from deerslayer, nokturnal, crz and me. cheers /Hampa [attachment deleted by admin, limit reached]",
      "url": "https://forum.toribash.com/showpost.php?p=8",
      "title": "Toribash Community - View Single Post -  Replays for TB 1.6"
    },
    {
      "post_id": "9",
      "thread_id": "9",
      "username": "hampa",
      "date": "Apr 27, 2006",
      "content": "How to punch A punch tutorial 1. Use camera keys (WASD or arrows) to position camera behind player As any seasoned boxer (or bar fighter) will tell you. Boxing is more about upperbody rotation than using the actual arms. So we set rotation to the chest add rotational force to it. 2. Mouse over the chest joint and hit 'Z' to set rotational force. 3. Click the right hip joint to put it in hold state so we counter the rotational force. (make him stand up a bit more). 4. Hit SPACE and step the game a bit The hand should now be close to the head. Add some force to the right elbow for a final blow. 5. Mouse over left elbow joint and hit 'Z' to contract it. 6. The punch is done. Hit SPACE couple of more times then watch the replay.",
      "url": "https://forum.toribash.com/showpost.php?p=9",
      "title": "Toribash Community - View Single Post -  How to punch"
    },
    {
      "post_id": "10",
      "thread_id": "10",
      "username": "veb",
      "date": "Apr 27, 2006",
      "content": "Re: How to punch I love punching, espically when you mange to knock of someones head :o",
      "url": "https://forum.toribash.com/showpost.php?p=10",
      "title": "Toribash Community - View Single Post -  How to punch"
    }
  ],
  "failed_ids": [
    1,
    2,
    3,
    4,
    5,
    6
  ],
  "metadata": {
    "total_posts": 4,
    "total_failed": 6,
    "timestamp": 1753374155.8520463
  }
}